run/tutorial1_twisted/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

TRef            TRef [0 0 0 1 0 0 0] 273.0;

nu              nu [0 2 -1 0 0 0 0] 1.78e-5;

rho             rho [1 -3 0 0 0 0 0] 1.2;

Cp              Cp [0 2 -2 -1 0 0 0] 1000;

beta            beta [0 0 0 -1 0 0 0] 1e-3;

Prt             Prt [0 0 0 0 0 0 0] 0.85;

Pr              Pr [0 0 0 0 0 0 0] 0.71; // nu/a = 1.78e-5/0.03*1000*1.2

// ************************************************************************* //
